Autodesk.Revit.DB.Structure.PointLoadTypeSet
A set that contains pointload types.

Autodesk.Revit.DB.Structure.PointLoadTypeSet.Insert(Autodesk.Revit.DB.Structure.pointloadType)
System.Int32
Insert the specified pointload type into the set.
item: The pointload type to be inserted into the set.
Returns: Returns whether the pointload type was inserted into the set.

Autodesk.Revit.DB.Structure.PointLoadTypeSet.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.Structure.PointLoadTypeSet.ReverseIterator
Autodesk.Revit.DB.Structure.PointLoadTypeSetIterator
Retrieve a backward moving iterator to the set.
Returns: Returns a backward moving iterator to the set.

Autodesk.Revit.DB.Structure.PointLoadTypeSet.ForwardIterator
Autodesk.Revit.DB.Structure.PointLoadTypeSetIterator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.Structure.PointLoadTypeSet.Erase(Autodesk.Revit.DB.Structure.pointloadType)
System.Int32
Removes a specified pointload type from the set.
item: The pointload type to be erased.
Returns: The number of pointload types that were erased from the set.

Autodesk.Revit.DB.Structure.PointLoadTypeSet.Contains(Autodesk.Revit.DB.Structure.pointloadType)
System.Boolean
Tests for the existence of a pointload type within the set.
item: The pointload type to be searched for.
Returns: The Contains method returns True if the pointload type is within the set, otherwise False.

Autodesk.Revit.DB.Structure.PointLoadTypeSet.Clear
void
Removes every pointload type from the set, rendering it empty.

Autodesk.Revit.DB.Structure.PointLoadTypeSet.Size
System.Int32
get
Returns the number of pointload types that are in the set.

Autodesk.Revit.DB.Structure.PointLoadTypeSet.IsEmpty
System.Boolean
get
Test to see if the set is empty.
Remarks: If the set is empty then True will be returned, otherwise False.